       01 WS-COMMON-AREA.
           05 WS-DATE.
               10 WS-YEAR  PIC 9(4).
               10 WS-MONTH PIC 9(2).
               10 WS-DAY   PIC 9(2).
           05 WS-TIME.
               10 WS-HOUR  PIC 9(2).
               10 WS-MIN   PIC 9(2).
               10 WS-SEC   PIC 9(2).
