CUSTSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,              X
               STORAGE=AUTO,TIOAPFX=YES
CUSTMAP  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
TITLE    DFHMDF POS=(1,20),LENGTH=20,ATTRB=(ASKIP,BRT),          X
               INITIAL='CUSTOMER INQUIRY'
CUSTID   DFHMDF POS=(3,15),LENGTH=8,ATTRB=(UNPROT,NUM)
CNAME    DFHMDF POS=(5,15),LENGTH=30,ATTRB=(ASKIP)
CADDR    DFHMDF POS=(7,15),LENGTH=40,ATTRB=(ASKIP)
MSG      DFHMDF POS=(22,1),LENGTH=79,ATTRB=(ASKIP,BRT)
         DFHMSD TYPE=FINAL
         END
