       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPORT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO 'INPUT.DAT'.
           SELECT OUTFILE ASSIGN TO 'OUTPUT.DAT'.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-REC PIC X(80).
       FD OUTFILE.
       01 OUT-REC PIC X(133).
       WORKING-STORAGE SECTION.
           COPY COMMON.
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT INFILE.
           OPEN OUTPUT OUTFILE.
           PERFORM READ-LOOP UNTIL EOF.
           CLOSE INFILE.
           CLOSE OUTFILE.
           STOP RUN.
       READ-LOOP.
           READ INFILE INTO IN-REC
               AT END SET EOF TO TRUE
           END-READ.
           WRITE OUT-REC FROM IN-REC.
